2020-02-06_20-26-51.056795/test.yml
---

#execution:
#
#  - executor: selenium
#
#    concurrency: 1
#
#    hold-for: 30s
#
#    iterations: 1
#
#    scenario:
#
#      script: src/test/java/Runner/testRunner.java
#
#      additional-classpath:
#      - netpaytest.jar
#
#    runner: testng


execution:
  - executor: selenium
    concurrency: 50
    ramp-up: 3m
    hold-for: 3m
    scenario: simple
    runner: junit

scenarios:
  simple:
    script: src/test/java/Runner/netpayTestPayment.java
    additional-classpath:
      - target/test.netpay-1.0-SNAPSHOT-jar-with-dependencies.jar
reporting:
  - module: blazemeter
    test: Payzone Performance Test
  - module: passfail
    criterias:
      -avg-rt>6000ms for 10s, continue as failed
      -avg-rt>5s for 1m, continue as failed
      -avg-rt of Confirmation>5s for 30s, continue as failed